# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6



# Примечание: Пользователь может вводить значения списка или список задан изначально.

# arr = [1, 1, 2, 0, -1, 3, 4, 4]
# set_1 = set(arr)
# print(len(set_1))

# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо,  K – положительное число.

# Input:   [1, 2, 3, 4, 5] k = 3

# Output:  [3, 4, 5, 1, 2]

# Примечание: Пользователь может вводить значения списка или список задан изначально.

# list1 = [1, 2, 3, 4, 5]
# k = 3

# for i in range(len(list1) - k):
#     for j in range(len(list1) - 1):
#         list1[j], list1[j - 1] = list1[j - 1], list1[j]
# print(list1)
    
# Напишите программу для печати всех уникальных значений в словаре. 

# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}] 

# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}


# Примечание: Список словарей задан изначально. Пользователь его не вводит

# d = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}]
# new_set = set()
# for i in d :
#     for j in i.values():
#         new_set.add(j)
# print(new_set)

k = 'ноутбук'

eng_dict = {"A":1, "E":1, "I":1, "O":1, "U":1, "L":1, "N":1, "S":1, "T":1, "R":1,"D":2, "G":2,"B":3, "C":3, "M":3, "P":3,"F":4, "H":4, "V":4, "W":4, "Y":4,"K":5,"J":8, "X":8,"Q":10, "Z":10}
rus_dict = {"А":1, "В":1, "Е":1, "И":1, "Н":1, "О":1, "Р":1, "С":1, "Т":1,"Д":2, "К":2, "Л":2, "М":2, "П":2, "У":2,"Б":3, "Г":3, "Ё":3, "Ь":3, "Я":3,"Й":4, "Ы":4,"Ж":5, "З":5, "Х":5, "Ц":5, "Ч":5,"Ш":8, "Э":8, "Ю":8,"Ф":10, "Щ":10, "Ъ":10}
count_ru = 0
count_eng = 0
for i in k:
    for key,value in rus_dict.items():
        if i == key.lower():
            count_ru += value
for i in k:
    for key,value in eng_dict.items():
        if i == key.lower():
            count_eng += value
if count_eng > count_ru:
    print(count_eng)
else:
    print(count_ru)