# Создать телефонный справочник
# 1. UI
# 2. Создать файл
# 3. Читать файл
# 4. Вывод данных на экран:
#     - считать файл
#     - сохранить в переменной
#     - вывод на экран
# 5. Запись контакта:
#     - запросить данные
#     - сохранить в переменной
#     - записать в файл
# 6. Поиск контакта:
#     - запросить данные
#     - сохранить в переменной
#     - считать файл
#     - сохранить в переменной
#     - произвести поиск

def user_interface():
    print('Выберите номер действия: \n'
        '1. Запись данных\n'
        '2. Вывести данные на экран\n'
        '3. Поиск контакта\n'
        '4. Выход')
user_interface()