# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

# n = (input("Введите N: "))
# while not n.isdigit():
#     print("Вы ввели не число")
#     n = (input("Введите N: "))
    
# n = int(n)
